# 학과, 학과별 사물함, 사물함의 건물 정보를 저장

# ----건물번호----
# 교내에서 사용하는 건물번호를 그대로 적용, 사이버관은 원래 C로 표현하는데 임의로 5로 지정
BUILDINGS = {'인문과학관':1, 
             '교수학습개발원':2,
             '사회과학관':3,
             '국제학사':4,
             '사이버관':5
            }

#학과 개수 : 33
MAJORS = {'프랑스어학부':{'count':66,'lockers':{('1','3'):66}},
          '독일어과':{'count':67,'lockers':{('1','3'):31,('4','2'):36}},
          '노어과':{'count':50,'lockers':{('1','3'):50}},
          '스페인어과':{'count':139,'lockers':{('1','3'):70,('4','2'):69}},
          '이탈리아어과':{'count':49,'lockers':{('2','1.5'):25,('4','2'):24}},
          '포르투갈어과':{'count':49,'lockers':{('2','2'):25,('4','2'):24}},
          '네덜란드어과':{'count':54,'lockers':{('4','2'):54}},
          '스칸디나비아어과':{'count':34,'lockers':{('4','2'):34}},
          '말레이인도네시아어과':{'count':25,'lockers':{('1','3'):25}},
          '아랍어과':{'count':49,'lockers':{('1','3'):49}},
          '태국어과':{'count':20,'lockers':{('1','3'):20}},
          '베트남어과':{'count':30,'lockers':{('1','3'):30}},
          '인도어과':{'count':30,'lockers':{('1','3'):30}},
          '터키아제르바이잔어과':{'count':30,'lockers':{('1','3'):30}},
          '페르시아어이란학과':{'count':40,'lockers':{('1','3'):40}},
          '몽골어과':{'count':22,'lockers':{('1','3'):22}},
          'ELLT학과':{'count':35,'lockers':{('1','3'):35}},
          '영미문학문화학과':{'count':44,'lockers':{('1','3'):34},('1','4'):10},
          'EICC학과':{'count':30,'lockers':{('1','3'):30}},
          '중국학대학':{'count':120,'lockers':{('1','3'):30,('1','5'):90}},
          '일본학대학':{'count':92,'lockers':{('1','3'):68,('1','4'):24}},
          '정치외교학과':{'count':85,'lockers':{('3','3'):50,('4','2'):15,('5','4'):20}},
          '행정학과':{'count':80,'lockers':{('1','3'):10,('3','3'):40,('3','4'):10,('5','4'):20}},
          '미디어커뮤니케이션학부':{'count':88,'lockers':{('1','4'):48,('3','3'):40}},
          '영어교육과':{'count':25,'lockers':{('2','1.5'):12,('2','3.5'):13}},
          '한국어교육과':{'count':50,'lockers':{('1','3'):14,('2','1.5'):18,('2','3.5'):18}},
          '프랑스어교육과':{'count':30,'lockers':{('1','3'):14,('2','1.5'):9,('2','3.5'):7}},
          '독일어교육과':{'count':12,'lockers':{('2','1.5'):12}},
          '중국어교육과':{'count':21,'lockers':{('2','1.5'):11,('2','3.5'):10}},
          '상경대학':{'count':150,'lockers':{('1','3'):74,('3','3'):76}},
          '경영학부':{'count':203,'lockers':{('5','4'):63,('5','5'):140}},
          '국제학부':{'count':66,'lockers':{('3','4'):22,('4','2'):44}},
          'LD학부':{'count':20,'lockers':{('4','3'):20}}
        }